"""
Функции для использования в шаблонах

Bottle позволяет импортировать модули в том числе в шаблонах, 
очень удобно в шаблонах пользоваться питон-функциями

Они собраны в этом модуле, пока - по-сути единственная функция - перевод строк. Ну могут быть и другие.

Про перевод 

* предполагается двуязычность
* изначально в коде пишу английские строки
* потом с помощью простого функционала собираю вызовы функции (=английские оригиналы) в YAML-файл
    * в процессе доработки кода проще вручную поддерживать YAML-файл, поэтому функционал сбора, по сути, нужен только в начале разработки
* там делаю перевод на русский язык
* функция ниже осуществляет перевод
* использую как в шаблонах, так и в питон модулях
"""

import yaml

with open("rus_strings.yaml","r") as fp:
    RUS_STR = yaml.load(fp, Loader=yaml.FullLoader)

def _(ss,lang="en"):
    if lang=="en":
        return ss
        
    if ss in RUS_STR:
        return RUS_STR[ss]
    else:
        return "." + ss
        
